1주차 

## 강의

1. 웹
    1. 클라이언트 - 서버 패러다임
    2. 자주 사용하는 HTTP Method
        1. GET, 
        2. POST - 데이터를 게시한다. (생성) 
            - 중복적으로 생성하는 느낌. 블로그에 여러 글 포스팅할 때
        3. PUT - 데이터를 교체한다. 
            - 없으면 새로 만들고 아니면 교체, 중복 생성 X
        4. PATCH - 데이터를 수정한다. 
            - 기존 A에 일부를 바꿔.
        5. DELETE - 데이터를 삭제한다. 

1. API 
    
    Application Programming Interface
    
    어플리케이션과 소통하는 방법(창구)를 정의한 것.
    
    - 모든 과정들을 다 추상화해 놓은 청소기의 전원 버튼 하나를 눌러 청소해.

Rest API란 무엇인가?

자주 들어본 말인데 무엇인지는 전혀 모르고 있다. 

API 쓸 때 Rest Architecture로 심플하고 일관되게 정함. 

- URL : 조작할 데이터 (명사)
- HTTP method: 데이터에 대한 행위 (동사)

간단히 명시!

## 실습 - 개발환경 준비하기

1. JDK-17 
    
    MSI Installer로 설치해야 된다. 
    
    자동설치 프로그램으로 Microsoft Windows의 표준대로 안전하게 설치한다.
